backend-api/app/Controllers/Auth.php

    public function login()
    {
        $json = $this->request->getJSON();

        $username = $json->username ?? null;
        $password = $json->password ?? null;

        if (!$username || !$password) {
            return $this->fail('Username atau Password kosong');
        }

        $userModel = new \App\Models\UserModel();
        $user = $userModel->where('username', $username)->first();
---
SELECT *
FROM `users`
WHERE `username` = 'superadmin'
 LIMIT 1